{
  "ConnectionStrings": {
    "MyDbContext": "Server=.\\SQLEXPRESS;Database=Gaska;User Id=sa;Password=nswdttssr;MultipleActiveResultSets=True;TrustServerCertificate=True;"
  },
  "GaskaApi": {
    "BaseUrl": "https://api.gaska.com.pl:8089",
    "Acronym": "TESTCDN",
    "Person": "Testowy",
    "Password": "TEST987",
    "Key": "dfgkl234hjk23bm,s",
    "ProductsPerPage": 1000,
    "ProductsInterval": 5,
    "ProductPerDay": 700,
    "ProductInterval": 1
  },
  "AllegroApi": {
    "BaseUrl": "https://api.allegro.pl.allegrosandbox.pl",
    "AuthBaseUrl": "https://allegro.pl.allegrosandbox.pl",
    "ClientName": "GaskaApiSync",
    "ClientId": "b19e42b895874ff094336f9bd22158c5",
    "ClientSecret": "qr9OcimmZUAlrfzXrqAJ4opf27ctxEUsyGCB93cGNd47ZyUkJidjH34rJyAcqgB5",
    "Scope": "allegro:api:sale:offers:read allegro:api:sale:offers:write allegro:api:sale:settings:read"
  },
  "AppSettings": {
    "CategoriesId": 56083,
    "LogsExpirationDays": 14,
    "FetchIntervalMinutes": 240,
    "OwnMarginPercent": 15,
    "AllegroMarginUnder5PLN": 0.5,
    "AllegroMarginBetween5and1000PLNPercent": 13,
    "AllegroMarginMoreThan1000PLN": 192,
    "AddPLNToBulkyProducts": 18.45,
    "AddPLNToCustomProducts": 300,
    "AllegroDeliveryName": "JAG API",
    "AllegroHandlingTime": "PT24H",
    "AllegroHandlingTimeCustomProducts": "PT72H",
    "AllegroSafetyMeasures": "Tekst bezpieczeństwa: \r\nLista ostrzeżeń dotyczących bezpieczeństwa części do kombajnów oparta o wymagania Rozporządzenia (UE) 2023/988 w sprawie ogólnego bezpieczeństwa produktów (GPSR):\r\n\r\n1.  Ostre krawędzie i elementy: Podczas montażu, demontażu i użytkowania części, zachowaj szczególną ostrożność ze względu na ostre krawędzie i wystające elementy, które mogą powodować skaleczenia. Używaj rękawic ochronnych.\r\n2.  Waga i stabilność: Nie przeciążaj kombajnu. Upewnij się, że każda część jest odpowiednio zamocowana i wyważona, aby uniknąć przewrócenia się maszyny.\r\n3.  Materiały łatwopalne: Unikaj używania otwartego ognia lub palenia w pobliżu części kombajnu. Przechowuj i używaj smarów, olejów i paliw z dala od źródeł ciepła i ognia.\r\n4.  Wysokie temperatury: Uważaj na gorące powierzchnie części, które mogą spowodować oparzenia. Odczekaj, aż ostygną przed dotknięciem.\r\n5.  Ciśnienie hydrauliczne: Przed odłączeniem przewodów hydraulicznych upewnij się, że ciśnienie w układzie zostało zredukowane. Wyciekający płyn hydrauliczny może być niebezpieczny dla skóry i oczu.\r\n6.  Zagrożenia mechaniczne: Upewnij się, że wszystkie osłony i zabezpieczenia są na swoim miejscu i w dobrym stanie, aby zapobiec kontaktowi z ruchomymi częściami maszyny. Wyłącz kombajn i poczekaj na zatrzymanie wszystkich ruchomych elementów przed rozpoczęciem jakiejkolwiek konserwacji lub naprawy.\r\n7.  Elektryczność: Przed pracami przy instalacji elektrycznej kombajnu, odłącz zasilanie, aby uniknąć porażenia prądem.\r\n8.  Ochrona słuchu: Podczas pracy z kombajnem używaj ochronników słuchu, aby zminimalizować ryzyko uszkodzenia słuchu.\r\n9.  Toksyczne substancje: Unikaj wdychania pyłów, oparów i gazów powstających podczas pracy kombajnu i konserwacji części. Zapewnij odpowiednią wentylację.\r\n10. Niebezpieczne środowisko: Zachowaj ostrożność podczas pracy w pobliżu linii energetycznych, rowów lub na nierównym terenie.\r\n11. Uszkodzenia strukturalne: Regularnie kontroluj stan części pod kątem korozji, pęknięć i innych uszkodzeń, które mogą osłabić strukturę i spowodować awarię. Uszkodzone elementy wymień niezwłocznie.\r\n12. Bezpieczeństwo dzieci i osób postronnych: Upewnij się, że dzieci i osoby postronne znajdują się w bezpiecznej odległości od pracującego kombajnu.",
    "AllegroWarranty": "default",
    "AllegroReturnPolicy": "default",
    "AllegroImpliedWarranty": "default",
    "AllegroResponsiblePerson": "JS-AGRO",
    "AllegroResponsibleProducer": "Gąska sp. z o.o."
  }
}